# parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
# 7,11,  18,19,  46,38 - 1024
anchors:
  - [8,8]  # P3/8
  - [16,16]  # P4/16
  - [78,69]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [
   # [-1, 1, Conv, [512, 1, 1]],

   [[4, 6, 9], 1, ASFF, [256]],
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [-1, 1, Center, [nc]],
  ]
