# parameters
nc: 10  # number of classes

depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
# anchors  1536
anchors:
  - [6,8,    10,22,  19,15]  # P3/8
  - [19,32,  39,22,  32,47]  # P4/16
  - [74,38,  65,74,  136,112]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],

   [-1, 1, SPP, [256, [5, 9, 13]]],
    #   [-1, 1, ASPP, [256, [1, 2, 4, 6]]],
   [[-1], 1, Segmenter, [1]],
   [[4, -1], 1, HeatMapParser, [256, 8, 0.3]],  # 7

   [-1, 1, Conv, [512, 3, 2]],  # 8-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 1, SPP, [1024, [3, 5, 7]]],
   [-1, 3, C3, [1024, False]],  # 12
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 20 (P3/8)

   [-1, 1, Blur, [128, 3]],  # 21 (P2/4-pred)

   [[21], 1, Center, [nc]],
  ]
